In [4]:
import pandas as pd
import numpy as np
%config IPCompleter.greedy=True

### Requirement
We have the dataset **BMI.xlsx**. This dataset are collected from some countries in several years. Here is step need to done:
1. Read dataset
2. Identify the issue of dataset
3. Standard the dataset base on issue #2
4. Create a pivot table to group by country and year

In [5]:
dataset = pd.read_excel("data/BMI.xlsx")
dataset.head()

       Country  Y1980  Y1981  Y1982  Y1983
0  Afghanistan  21.48  21.46  21.45  21.44
1      Albania  25.22  25.24  25.26  25.27
2      Algeria  22.26  22.35  22.44  22.52

In [6]:
bim_dataset.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 5 columns):
Country    3 non-null object
Y1980      3 non-null float64
Y1981      3 non-null float64
Y1982      3 non-null float64
Y1983      3 non-null float64
dtypes: float64(4), object(1)
memory usage: 200.0+ bytes

### The year data is from columns: Y1980, Y1981, Y1982, Y1983. We need to convert them into on column call 'year'

In [7]:
new_bim_dataset = pd.melt(frame = bim_dataset, id_vars = "Country", var_name="Year", value_vars = ["Y1980", "Y1981", "Y1982", "Y1983"])

In [8]:
new_bim_dataset.Year = new_bim_dataset.Year.apply(lambda y: y[1:])

In [9]:
new_bim_dataset

        Country  Year  value
0   Afghanistan  1980  21.48
1       Albania  1980  25.22
2       Algeria  1980  22.26
3   Afghanistan  1981  21.46
4       Albania  1981  25.24
5       Algeria  1981  22.35
6   Afghanistan  1982  21.45
7       Albania  1982  25.26
8       Algeria  1982  22.44
9   Afghanistan  1983  21.44
10      Albania  1983  25.27
11      Algeria  1983  22.52

In [10]:
new_bim_dataset.pivot(index="Country", columns="Year", values="value")

Year          1980   1981   1982   1983
Country
Afghanistan  21.48  21.46  21.45  21.44
Albania      25.22  25.24  25.26  25.27
Algeria      22.26  22.35  22.44  22.52